{
  "siddhi-io-twitter": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 09:49:40 GMT",
    "description": "The siddhi-io-twitter extension is an extension to Siddhi. It publishes event data from Twitter Applications in the key-value map format."
  },
  "siddhi-execution-markov": {
    "lastModifiedDateTime": "Wed, 27 Mar 2019 15:24:36 GMT",
    "description": "The siddhi-execution-markov extension is an extension to Siddhi that allows abnormal patterns relating to user activity to be detected when carrying out real time analysis."
  },
  "siddhi-script-js": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 16:08:14 GMT",
    "description": "The siddhi-script-js is an extension to Siddhi that allows to include JavaScript functions within the Siddhi Query Language."
  },
  "siddhi-io-email": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 11:58:34 GMT",
    "description": "The siddhi-io-email extension is an extension to Siddhi that receives and publishes events via email. Using the extension, events can be published through smtp mail server and received through 'pop3' or 'imap' mail serves."
  },
  "siddhi-execution-unique": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 14:31:07 GMT",
    "description": "The siddhi-execution-unique extension is an extension to Siddhi that processes event streams based on unique events. Different types of unique windows are available to hold unique events based on the given unique key parameter."
  },
  "siddhi-execution-tensorflow": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 10:23:23 GMT",
    "description": "The siddhi-execution-tensorflow is an extension to Siddhi that adds support for inferences from pre-built TensorFlow SavedModels using Siddhi."
  },
  "siddhi-io-websocket": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 09:49:48 GMT",
    "description": "The siddhi-io-websocket extension is an extension to Siddhi that allows to receive and publish events through WebSocket."
  },
  "siddhi-execution-priority": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 14:33:15 GMT",
    "description": "The siddhi-execution-priority extension is an extension to Siddhi that keeps track of the priority of events in a stream."
  },
  "siddhi-io-cdc": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 12:13:20 GMT",
    "description": "The siddhi-io-cdc extension is an extension to Siddhi. It receives change data from MySQL, MS SQL Server, Postgresql, H2 and Oracle in the key-value format."
  },
  "siddhi-store-redis": {
    "lastModifiedDateTime": "Mon, 18 Feb 2019 10:30:36 GMT",
    "description": "The siddhi-store-redis extension is an extension for siddhi redis event table implementation. This extension can be used to persist events to a redis cloud instance of version 4.x.x."
  },
  "siddhi-execution-kalmanfilter": {
    "lastModifiedDateTime": "Wed, 27 Mar 2019 15:25:33 GMT",
    "description": "The siddhi-execution-kalman-filter extension is an extension to Siddhi provides that Kalman filtering capabilities to Siddhi. This allows you to detect outliers of input data."
  },
  "siddhi-execution-regex": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 11:14:43 GMT",
    "description": "The siddhi-execution-regex extension is an extension to Siddhi that provides basic RegEx execution capabilities."
  },
  "siddhi-map-keyvalue": {
    "lastModifiedDateTime": "Mon, 08 Apr 2019 13:07:47 GMT",
    "description": "The siddhi-map-keyvalue extension is an extension to Siddhi that supports mapping incoming events with Key-Value map format to a stream at the source, and mapping a stream to Key-Value map events at the sink."
  },
  "siddhi-io-jms": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 11:58:06 GMT",
    "description": "The siddhi-io-jms extension is an extension to Siddhi that used to receive and publishe events via JMS Message. This extension allows users to subscribe to a JMS broker and receive/publish JMS messages."
  },
  "siddhi-map-text": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 06:02:32 GMT",
    "description": "The siddhi-map-text extension is an extension to Siddhi that supports mapping incoming text messages to a stream at the source, and mapping a stream to text messages at the sink."
  },
  "siddhi-store-cassandra": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 19:23:56 GMT",
    "description": "The siddhi-store-cassandra extension is an extension to Siddhi that can be used to persist events to a Cassandra instance of the users choice. Find some useful links below:"
  },
  "siddhi-store-hbase": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 16:56:20 GMT",
    "description": "The siddhi-store-hbase extension is an extension to Siddhi that can be used to persist events to a HBase instance of the users choice. Find some useful links below:"
  },
  "siddhi-io-prometheus": {
    "lastModifiedDateTime": "Fri, 01 Feb 2019 07:56:23 GMT",
    "description": "The siddhi-io-prometheus extension is an extension to Siddhi. The Prometheus-sink publishes Siddhi events as Prometheus metrics and expose them to Prometheus server. The Prometheus-source retrieves Prometheus metrics from an endpoint and send them as Siddhi events."
  },
  "siddhi-execution-geo": {
    "lastModifiedDateTime": "Tue, 02 Apr 2019 06:33:51 GMT",
    "description": "The siddhi-execution-geo extension is an extension to Siddhi that provides geo data related functionality such as checking whether a given geo coordinate is within a predefined geo-fence, etc. Following are the functions of the Geo extension."
  },
  "siddhi-store-rdbms": {
    "lastModifiedDateTime": "Sun, 07 Apr 2019 13:32:52 GMT",
    "description": "The siddhi-store-rdbms extension is an extension to Siddhi that can be used to persist events to an RDBMS instance of the user's choice."
  },
  "siddhi-store-mongodb": {
    "lastModifiedDateTime": "Mon, 18 Feb 2019 10:30:40 GMT",
    "description": "The siddhi-store-mongodb extension is an extension to Siddhi that can be used to persist events to a MongoDB instance of the users choice. Find some useful links below:"
  },
  "siddhi-execution-time": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 10:25:52 GMT",
    "description": "The siddhi-execution-time extension is an extension to Siddhi that provides time related functionality to Siddhi such as getting current time, current date, manipulating/formatting dates and etc."
  },
  "siddhi-execution-map": {
    "lastModifiedDateTime": "Tue, 12 Feb 2019 18:18:29 GMT",
    "description": "The siddhi-execution-map extension is an extension to Siddhi that provides the capability to send a map object inside Siddhi stream definitions and use it inside queries. The following are the functions of the map extension.."
  },
  "siddhi-io-http": {
    "lastModifiedDateTime": "Wed, 17 Apr 2019 13:29:42 GMT",
    "description": "The siddhi-io-http extension is an extension to Siddhi that allows you to receive and publish events via http and https transports and also allow you perform synchronous request and response. This extension works with WSO2 Stream Processor and with standalone Siddhi."
  },
  "siddhi-io-kafka": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 13:55:42 GMT",
    "description": "The siddhi-io-kafka extension is an extension to Siddhi. This implements siddhi kafka source and sink that can be used to receive events from a kafka cluster and to publish events to a kafka cluster."
  },
  "siddhi-execution-extrema": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 14:28:24 GMT",
    "description": "The siddhi-execution-extrema extension is an extension to Siddhi that processes event streams based on different arithmetic properties. Different types of processors are available to extract the extremas from the event streams according to the specified attribute in the stream."
  },
  "siddhi-map-wso2event": {
    "lastModifiedDateTime": "Mon, 08 Apr 2019 13:11:13 GMT",
    "description": "The siddhi-map-wso2event extension is an extension to Siddhi that can be used to convert WSO2 events to/from Siddhi events."
  },
  "siddhi-execution-unitconversion": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 13:59:20 GMT",
    "description": "The siddhi-execution-unitconversion extension is an extension to Siddhi that enables conversions of length, mass, time and volume units."
  },
  "siddhi-execution-graph": {
    "lastModifiedDateTime": "Wed, 27 Mar 2019 06:12:20 GMT",
    "description": "The siddhi-execution-graph extension is an extension to Siddhi that provides graph related functionality to Siddhi such as getting size of largest connected component of a graph, maximum clique size of a graph, etc."
  },
  "siddhi-io-tcp": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 11:57:35 GMT",
    "description": "The siddhi-io-tcp extension is an extension to Siddhi that allows to receive and publish events through TCP."
  },
  "siddhi-execution-env": {
    "lastModifiedDateTime": "Fri, 15 Feb 2019 11:14:25 GMT",
    "description": "The siddhi-execution-env extension is an extension to Siddhi that provides the capability to read environment properties inside Siddhi stream definitions and use it inside queries. Functions of the env extension are as follows.."
  },
  "siddhi-execution-approximate": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 10:22:45 GMT",
    "description": "The siddhi-execution-approximate is an extension to Siddhi that performs approximate computing on event streams."
  },
  "siddhi-map-xml": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 18:07:08 GMT",
    "description": "The siddhi-map-xml extension is an extension to Siddhi that supports mapping incoming XML events to a stream at the source, and mapping a stream to XML events at the sink."
  },
  "siddhi-io-file": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 13:29:15 GMT",
    "description": "The siddhi-io-file extension is an extension to Siddhi which is used to receive/publish event data from/to file. It supports both binary and text formats."
  },
  "siddhi-execution-timeseries": {
    "lastModifiedDateTime": "Tue, 02 Apr 2019 09:53:59 GMT",
    "description": "The siddhi-execution-timeseries extension is an extension to Siddhi which enables users to forecast and detect outliers in time series data, using Linear Regression Models."
  },
  "siddhi-execution-sentiment": {
    "lastModifiedDateTime": "Tue, 02 Apr 2019 06:32:34 GMT",
    "description": "The siddhi-execution-sentiment extension is an extension to Siddhi that performs sentiment analysis using Afinn Wordlist-based approach."
  },
  "siddhi-io-sqs": {
    "lastModifiedDateTime": "Wed, 13 Feb 2019 11:48:29 GMT",
    "description": "The siddhi-io-sqs extension is an extension to Siddhi that used to receive and publish events via AWS SQS Service. This extension allows users to subscribe to a SQS queue and receive/publish SQS messages."
  },
  "siddhi-execution-string": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 20:02:14 GMT",
    "description": "The siddhi-execution-string is an extension to Siddhi that provides basic string handling capabilities such as con-cat, length, convert to lowercase, and replace all."
  },
  "siddhi-io-wso2event": {
    "lastModifiedDateTime": "Tue, 26 Mar 2019 06:50:22 GMT",
    "description": "The siddhi-io-wso2event extension is an extension to Siddhi that receives and publishes events in the WSO2Event format via Thrift or Binary protocols."
  },
  "siddhi-map-binary": {
    "lastModifiedDateTime": "Mon, 08 Apr 2019 12:04:56 GMT",
    "description": "The siddhi-map-binary extension is an extension to Siddhi that can be used to convert binary events to/from Siddhi events."
  },
  "siddhi-execution-streamingml": {
    "lastModifiedDateTime": "Wed, 27 Mar 2019 15:26:51 GMT",
    "description": "The siddhi-execution-streamingml is an extension to Siddhi that performs streaming machine learning on event streams."
  },
  "siddhi-execution-reorder": {
    "lastModifiedDateTime": "Tue, 02 Apr 2019 06:15:39 GMT",
    "description": "The siddhi-execution-reorder extension is an extension to Siddhi that is used for reordering events from an unordered event stream. Reorder extension is implemented using the K-Slack and alpha K-Stack algorithms."
  },
  "siddhi-execution-stats": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 10:21:44 GMT",
    "description": "The siddhi-execution-stats extension is an extension to Siddhi that provides statistical functions for aggregated events. Currently this contains median function which calculate the median of aggregated events. Calculation of median is done for each event arrival and expiry, it is not recommended to use this extension for large window sizes."
  },
  "siddhi-io-mqtt": {
    "lastModifiedDateTime": "Thu, 11 Apr 2019 13:11:04 GMT",
    "description": "The siddhi-io-mqtt is an extension to Siddhi mqtt source and sink implementation,that publish and receive events from mqtt broker."
  },
  "siddhi-execution-math": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 20:23:25 GMT",
    "description": "The siddhi-execution-math is an extension to Siddhi, which provides useful mathematical functions that can make your siddhi queries more flexible."
  },
  "siddhi-io-rabbitmq": {
    "lastModifiedDateTime": "Wed, 10 Apr 2019 09:49:46 GMT",
    "description": "The siddhi-io-rabbitmq is an extension to Siddhi that publish and receive events from rabbitmq broker."
  },
  "siddhi-map-csv": {
    "lastModifiedDateTime": "Mon, 08 Apr 2019 13:08:12 GMT",
    "description": "The siddhi-map-csv extension is an extension to Siddhi that supports mapping incoming events with csv format to a stream at the source, and mapping a stream to csv format events at the sink."
  },
  "siddhi-store-solr": {
    "lastModifiedDateTime": "Tue, 09 Apr 2019 17:11:52 GMT",
    "description": "The siddhi-store-solr extension is an extension for siddhi Solr event table implementation. This extension can be used to persist events to a Solr cloud instance of version 6.x.x."
  },
  "siddhi-map-json": {
    "lastModifiedDateTime": "Mon, 08 Apr 2019 12:03:19 GMT",
    "description": "The siddhi-map-json extension is an extension to Siddhi which is used to convert JSON message to/from Siddhi events."
  }
}
